Repository: MicrobitPolska/microbitpolskaorg
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pl

source: About
pl: O nas

source: Workshops
pl: Warsztaty

source: Sponsors
pl: Sponsorzy

source: Code of conduct
pl: Kodeks postępowania

source: Contact
pl: Kontakt

source: Bring BBC Micro:bit and Python to Polish students
pl: Pokaż polskim uczniom urządzenie BBC Micro:bit oraz język Python

source: Give us some more time :)
pl: Daj nam trochę czasu :)

source: <p>We are going to publish some blog post as soon as possible !</p>
pl: <p>Niebawem zaczniemy publikować wpisy na naszym blogu !</p>

source: Location
pl: Miejsce

source: Poland
pl: Polska

source: Around the Web
pl: Nasze społeczności

source: About Microbit:Polska
pl: O Microbit:Polska

source: Microbit:Polska is a project with a very specific goal: teaching about programming with fun !
pl: Microbit:Polska jest projektem, którego celem jest uczenie programowania połączone z zabawą !

source: <p>You have students around 10 years old, and you want to teach them about programming.</p> <p><b>What do you think is the best way to do this?</b></p> <p><b><a href="https://microbit.org">BBC</a></b> took this seriously and they decided to develop, together with more than 20 partners, <b>BBC Micro:bit</b>.<br /> An amazing device, with a 5x5 matrix leds, a lot of inputs and sensors.<br /> Then the <b><a href="https://pyfound.blogspot.co.uk/2016/03/a-million-children.html">Python Software Foundation</a></b> jumped in and said that it was a super cool project, why don't we put <b><a href="https://www.python.org">Python</a></b> inside it?<br /> <p>The result?</p> <p>You can use BBC Micro:bit and Python to teach young students about programming. You can do this while having fun, and with a programming language that is used almost everywhere.</p> <p>What about <b>Microbit:Polska</b>?</p> <p>Well in UK they gave <b><a href="http://www.bbc.co.uk/mediacentre/latestnews/2016/bbc-micro-bit-schools-launch">1 million Micro:bits</a></b> to school children for free, why we should not have something similar in Poland?</p> <p>Come join in the fun!</p>
pl: <p>Znasz uczniów w wieku około 10 lat i chcesz nauczyć ich programowania.</p> <p><b>Jak myślisz jaki jest najlepszy na to sposób ?</b></p> <p><b><a href="https://microbit.org">BBC</a></b> podszedł do tego poważnie i zdecydował się opracować z przeszło 20 partnerami rozwiązanie <b>BBC Micro:bit</b>.<br /><br /> To niesamowite urządzenie z matrycą LED 5x5 z dużą ilością wejść, wyjść i czujników.<br /> Fundacja <b><a href="https://pyfound.blogspot.co.uk/2016/03/a-million-children.html">Python Software Foundation</a></b> zachwyciła się projektem i stwierdziła: dlaczego by nie zaimplementować wewnątrz języka <b><a href="https://www.python.org">Python</a></b>?<br /> <p>Co dalej?</p> <p>Możesz posługiwać się BBC Micro:bit i Pythonem do nauki programowania dla młodzieży. Przy okazji zabawy uczysz się programowania w języku używanym niemalże wszędzie.</p> <p><b>Dlaczego Microbit:Polska</b>?</p> <p>W Wielkiej Brytanii podarowano <b><a href="http://www.bbc.co.uk/mediacentre/latestnews/2016/bbc-micro-bit-schools-launch">1 million płytekMicro:bit</a></b> za darmo dla dzieci w szkołach. Dlaczego by nie mieć czegoś podobnego w Polsce ?</p> <p>Przyjdź i przyłącz się do zabawy!</p>

source: <p>The workshop is called <b>FunWithMicrobit</b>, and that is the goal: having fun with it.</p> <p>It takes around 6 hours: the first 4 hours are dedicated to teaching how to use the BBC Micro:bit and program it with Python.</p> <p>Python is an open source programming language, easy to learn and easy to use, that perfectly fits Micro:bit.</p> <p>The last 2 hours are an open lab, where you develop your Micro:bit project, helped by the Python programmers, and then show it to others.</p> <p>A workshop is formed by 30 students, 5 teachers and 5 Python programmers, and it is held during one day of the week-end.</p> <p>You can check <a href="https://github.com/MicrobitPolska/FunWithMicrobit">the materials for the workshop</a>.</p>
pl: <p>Warsztaty zostały nazwane <b>FunWithMicrobit</b>. Podstawowym celem jest: nauka programowania i wspaniała zabawa.</p> <p>Warsztat trwa około 6 godzin: pierwsze 4 godziny poświęcone są nauce jak używać i programować płytki BBC Micro:bit przy pomocy Pythona.</p> <p>Python jest open sourcowym językiem programowania, łatwym do nauki i używania, który perfekcyjnie pasuje do rozwiązania Micro:bit.</p> <p>Ostatnie 2 godziny prowadzone są w postaci otwartych warsztatów, gdzie można rozwijać swoje projekty na platformie Micro:bit wspomaganych przez programistów Pythona z możliwością dzielenia się zdobytą wiedzą i rozwiązaniami</p> <p>Jednodniowy weekendowy warsztat prowadzony jest w grupie 30 uczniów, 5 nauczycieli oraz 5 programistów Pythona. </p> <p>Zobacz <a href="https://github.com/MicrobitPolska/FunWithMicrobit">materiały do warsztatów</a>.</p>

source: <p><b>Microbit:Polska</b> is a project made up of people with different skills, personalities and experiences. <br /> And it is through these differences that this project can grow and evolve. </p> <p>We believe that as a Student, Teacher and Programmer we should be driven by being <b>#open</b>, <b>#considerate</b> and <b>#respectful</b>.</p> <h3>The very very short version</h3> <p>We are good to each other, we contribute to this project and we take part in it not because we have to but because we want to. </p> <h3>The long version</h3> <p>For the long version we decided to use the <a href="http://berlincodeofconduct.org/"><b>Berlin Code of Conduct</b></a>.</p> <p>Questions/Comments/Reports?</p> <p>For anything related to the Code of Conduct feel free to write to the Microbit:Polska organisers: <b>info@microbitpolska.org</b> </p>
pl: <p><b>Microbit:Polska</b> jest projektem współtworzonym przez ludzi o różnych umiejętnościach, osbowościach i doświadczeniu. <br /> Dzięki tej różnorodności projekt może ewoluować i rozwijać się. </p> <p>Wierzymy, że jako uczniowie, nauczyciele czy programiści powinniśmy kierować się wartościami: <b>#otwartość</b>, <b>#rozwaga</b> i <b>#szacunek</b>.</p> <h3>Nadrzędny cel</h3> <p>Jako pozytywnie zakręceni jesteśmy zaangażowani w popularyzowanie idei nauki Pythona przez zabawę. </p> <h3>Działanie długofalowe</h3> <p>Docelowo zdecydowaliśmy się działać zgodnie z <a href="http://berlincodeofconduct.org/"><b>Berlińskim Kodeksem Postępowania</b></a>.</p> <p>Pytania / Komentarze / Informacje?</p> <p>Wszelkie pytania związane z Kodeksem Postępowania skieruj do organizatorów Microbit:Polska : <b>info@microbitpolska.org</b> </p>

source: <p>Are you curious where we are going to have the next workshop?</p> <p>Or maybe you want to ask us more information about <b>Microbit:Polska</b> or <b>you want to host a workshop in your school?</b></p> <p>Well, whatever is the reason we cannot wait to be in touch with you!</p> <p>Just drop us a few lines and we will be back as soon as possible.</p> <p>Ohhh, yes this is our email: <b>info@microbitpolska.org</b></p>
pl: <p>Czy jesteś ciekaw, gdzie będziemy prowadzić kolejny warsztat?</p> <p>A może chcesz zadać nam więcej pytań o <b>Microbit:Polska</b> albo <b> chcesz zorganizować warsztaty w swojej szkole?</b></p> <p>Nie możemy doczekać się kontaktu z Twojej strony!</p> <p>Napisz czym prędzej do nas maila, a my postaramy się szybko odpowiedzieć.</p> <p>Tutaj jest nasz email: <b>info@microbitpolska.org</b></p>

source: Microbit:Polska is a project with a very specific goal: teaching about programming with fun!
pl: Microbit:Polska jest projektem, którego celem jest uczenie programowania połączone z zabawą !

source: The <a href="https://www.python.org">Python Software Foundation</a> helped the Microbit:Polska project from the beginning, providing the initial founding to start the project. The PSF is also one of the partner of the Micro:bit Education Foundation.
pl: Fundacja <a href="https://www.python.org">Python Software Foundation</a> od początku pomagała w uruchomieniu projektu Microbit:Polska. PSF jest również jednym z partnerów Fundacji Edukacyjnej Micro:bit.

source: Close
pl: Zamknij

source: English
pl: Angielski

source: Polish
pl: Polski
